src/cf/src/InformationRegisters/ИсторияЗаказовПокупателейПоСтатусам/ИсторияЗаказовПокупателейПоСтатусам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаказовПокупателейПоСтатусам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаказаПокупателя</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/СистемныеОповещения/СистемныеОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СистемныеОповещения</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Новое</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отображено</name>
    <comment>Было или небыло выведено оповещение пользователю</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ТипыИзмеряемыхВеличин/ТипыИзмеряемыхВеличин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзмеряемыхВеличин</name>
  <enumValues>
    <name>Вес</name>
  </enumValues>
  <enumValues>
    <name>Объем</name>
  </enumValues>
  <enumValues>
    <name>Площадь</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>КоличествоШтук</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
    <comment>Выбирается программно, </comment>
  </enumValues>
  <enumValues>
    <name>Мощность</name>
  </enumValues>
  <enumValues>
    <name>Энергия</name>
  </enumValues>
  <enumValues>
    <name>ЭлектрическийЗаряд</name>
  </enumValues>
  <enumValues>
    <name>Время</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СтатусыЗаказовПокупателя/СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателя</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/РаботаСДокументамиВызовСервера/Module.bsl
#Область Номенклатура

Функция ПолучитьДанныеВыбораНоменклатуры(ПараметрыПолученияДанных) Экспорт
	Возврат Справочники.Номенклатура.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);	
КонецФункции

Функция КоличествоЕдиницыТолькоЦелое(Номенклатура, Упаковка) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Единица КАК Единица
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЫБОР
	                      |			КОГДА &Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |				ТОГДА ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура).Единица
	                      |			ИНАЧЕ ВЫРАЗИТЬ(&Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения).Единица
	                      |		КОНЕЦ КАК Единица) КАК ВЗ
	                      |ГДЕ
	                      |	ВЗ.Единица.ТипИзмеряемойВеличины В (ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка))");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой();			
КонецФункции	

#КонецОбласти  

#Область Разное  

Функция ПолучитьСтатусЗаказПокупателя(ЗаказПокупателя) Экспорт
	
	Результат = Перечисления.СтатусыЗаказовПокупателя.Новый;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК ИсторияЗаказовПокупателейПоСтатусамСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя); 
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() = 0 Тогда Иначе
		Результат = Выборка[0].СтатусЗаказаПокупателя;	
	КонецЕсли;

	Возврат Результат; 
КонецФункции

Процедура ДобавитьКомментарий(Владелец, Описание, Адресат = Неопределено) Экспорт
	РегистрыСведений.КонтекстныеОбсуждения.ДобавитьСобытие(Владелец, Описание, Адресат);	
КонецПроцедуры

Функция ПолучитьНепоказанныеСистемныеОповещения() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Массив;	
	ТЗ = РегистрыСведений.СистемныеОповещения.ПолучитьНеотображённые(ПараметрыСеанса.Пользователь);
	Для Каждого Стр Из ТЗ Цикл
		Результат.Добавить(Новый Структура("Описание, НавигационнаяСсылка", Стр.Описание, Стр.НавигационнаяСсылка));
		РегистрыСведений.СистемныеОповещения.ОтметитьКакОтображённое(Стр.Сотрудник, Стр.ID);
	КонецЦикла;	
	Возврат Результат; 
КонецФункции

Функция ПолучитьСуммуОснованияДляПлатёжногоДокумента(Документ) Экспорт
	Если ТипЗнч(Документ) = Тип("СправочникСсылка.Контрагенты") Тогда
		СуммаДокумента = 0;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		СуммаДокумента = 0;	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатёжнаяВедомостьНаАванс") 
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ВыплатаЗарплаты") Тогда
		СуммаДокумента = Документ.Сумма-ДенежныеСредства.ПолучитьОстатокВыплатыЗПОснованию(Документ,Истина);
	Иначе	
		СуммаДокумента = Документ.Сумма;
	КонецЕсли;	
	Результат = Новый Структура("Сумма, СтавкаНДС, СуммаНДС, НесколькоСтавокНДС, РасшифровкаНДС", СуммаДокумента,, 0, Ложь, ""); 
	МасРасшифровкаНДС = Новый Массив;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или
		ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")  Тогда
		ТЗ = Документ.ТЧТовары.Выгрузить(, "СтавкаНДС, СуммаНДС, СуммаСНДС");
		ТЗ.Свернуть("СтавкаНДС", "СуммаНДС, СуммаСНДС");
		Если ТЗ.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(Результат, ТЗ[0], "СтавкаНДС, СуммаНДС");
		ИначеЕсли ТЗ.Количество() > 1 Тогда	
			Результат.СуммаНДС = ТЗ.Итог("СуммаНДС");
			Результат.НесколькоСтавокНДС = Истина;
			МасРасшифровкаНДС = РаботаСДокументами.КонвертироватьНДСПлатёжногоДокументаВМассив(ТЗ);	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или 
		ТипЗнч(Документ) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Или
		ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Или
		ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Результат.Сумма = Документ.Сумма;	
	КонецЕсли;
	Результат.РасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(МасРасшифровкаНДС);
	Возврат Результат;	
КонецФункции	

Функция ПолучитьСуммуДокумента(Док) Экспорт
	Возврат ?(ЗначениеЗаполнено(Док), Док.Сумма, 0);		
КонецФункции	

Функция ПолучитьГраницуДокумента(Знач ДокОбъект) Экспорт
	Ссылка = ДокОбъект.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Если ДокОбъект.Дата = Ссылка.Дата Тогда		
			Возврат Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
		Иначе
			Возврат Новый Граница(ДокОбъект.Дата, ВидГраницы.Исключая);	
		КонецЕсли;	
	Иначе
		Возврат ТекущаяДатаСеанса();	
	КонецЕсли;			
КонецФункции	

Функция ПолучитьКуратораДоговора(Договор,Дата = Неопределено) Экспорт
	Возврат Справочники.ДоговорыСКонтрагентами.ПолучитьКуратораДоговора(Договор,Дата);
КонецФункции // ()

Функция КлиентуЗапрещеноОтгружать(Контрагент, ДатаОтгрузки) Экспорт
	Возврат Контрагент.ЗапретОтгрузок;
КонецФункции

#КонецОбласти
